MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
#include "LightService.h"
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <TimeLib.h>
#include <NtpClientLib.h>
#include <WiFiUdp.h>
#include "SSDP.h"
#include <aJSON.h> // Replace avm/pgmspace.h with pgmspace.h there and set #define PRINT_BUFFER_LEN 4096 ################# IMPORTANT
#include <assert.h>
#include <FS.h>
#include <ESP8266HTTPClient.h>
#include <QList.h>
#include "QList.cpp"

String macString;
String bridgeIDString;
String ipString;
String netmaskString;
String gatewayString;
// The username of the client (currently we authorize all clients simulating a pressed button on the bridge)
String client;


// Group and Scene file name prefixes for SPIFFS support 
String GROUP_FILE_TEMPLATE = "GROUP-%d.json";
String SCENE_FILE_TEMPLATE = "SCENE-%d.json";


ESP8266WebServer *HTTP;

class ProxyHandler : public LightHandler {
  private:
    String _target = "";
    String _id = "";
    String _localId = "";
    HueLightInfo _info;
  public:
    ProxyHandler(String &target, String mac, aJsonObject* entry) : _target(target), _id(entry->name) {
      mac.replace(':', '.');
      if (!_id.startsWith(mac)) {
        _localId.concat(mac);
        _localId.concat("-");
        _localId.concat(_id);
      }
      _info.local = false;
      aJsonObject* state = aJson.getObjectItem(entry, "state");
      for (int i = 0; i < aJson.getArraySize(state); i++) {
        aJsonObject *entry = aJson.getArrayItem(state, i);
        if (entry->name == "on" && entry->type == aJson_Boolean) {
          _info.on = entry->valuebool;
        } else if (entry->name == "bri" && entry->type == aJson_Int) {
          _info.brightness = entry->valueint;
        } else if (entry->name == "hue" && entry->type == aJson_Int) {
          _info.hue = entry->valueint;
        } else if (entry->name == "sat" && entry->type == aJson_Int) {
          _info.saturation = entry->valueint;
        } else if (entry->name == "alert" && entry->type == aJson_String) {
          _info.alert = entry->valuestring;
        } else if (entry->name == "effect" && entry->type == aJson_String) {
          _info.effect = entry->valuestring;
        }
      }
    }
    void handleQuery(int lightNumber, HueLightInfo newInfo, aJsonObject* raw) {
      HTTPClient http;
      bool begin_ret = http.begin(_target + "/api/api/lights/" + _id + "/state");
      char *msgstr = aJson.print(raw);
      String msg_str = msgstr;
      int responseCode = http.sendRequest("PUT", msg_str);
      free(msgstr);
      if (responseCode != 200) {
        Serial.println("Got bad response to remote light PUT");
      }
      http.end();
    }

    HueLightInfo getInfo(int lightNumber) {
      return _info;
    }

    String getId(int lightNumber) {
      if (_localId.length()) {
        return _localId;
      }
      return _id;
    }
};
QList<ProxyHandler*> foreign_lights;

struct rgbcolor {
  rgbcolor(uint8_t r, uint8_t g, uint8_t b) : r(r), g(g), b(b) {};
  uint8_t r;
  uint8_t g;
  uint8_t b;
};

#define MIN(a,b) ((a<b)?a:b)
#define MAX(a,b) ((a>b)?a:b)
struct hsvcolor {
  hsvcolor(const rgbcolor& color) {
    float r = ((float)color.r)/COLOR_SATURATION;
    float g = ((float)color.g)/COLOR_SATURATION;
    float b = ((float)color.b)/COLOR_SATURATION;
    float mi = MIN(MIN(r,g),b);
    float ma = MAX(MAX(r,g),b);
    float diff = ma - mi;
    v = ma;
    h = 0;
    s = (!v)?0:(diff/ma);
    if (diff) {
      if (r == v) {
            h = (g - b) / diff + (g < b ? 6.0f : 0.0f);
        } else if (g == v) {
            h = (b - r) / diff + 2.0f;
        } else {
            h = (r - g) / diff + 4.0f;
        }
        h /= 6.0f;
    }
  };
  float h;
  float s;
  float v;
};

String removeSlashes(String uri) {
  if (uri[0] == '/') {
    uri = uri.substring(1);
  }
  if (uri.length() && uri[uri.length() - 1] == '/') {
    uri = uri.substring(0, uri.length() - 1);
  }
  return uri;
}

String getPathSegment(String uri) {
  // assume slashes removed
  int slash = uri.indexOf("/");
  if (slash == -1) {
    return uri;
  }
  return uri.substring(0, slash);
}

String removePathSegment(String uri) {
  // assume slashes removed
  int slash = uri.indexOf("/");
  if (slash == -1) {
    return "";
  }
  return uri.substring(slash);
}

String getWildCard(String requestUri, String wcUri, int n, char wildcard = '*') {
  wcUri = removeSlashes(wcUri);
  requestUri = removeSlashes(requestUri);
  String wildcardStr;
  wildcardStr += wildcard;
  int i = 0;
  while (1) {
    String uPath = getPathSegment(wcUri);
    String ruPath = getPathSegment(requestUri);
    if (uPath == wildcardStr) {
      if (i == n) {
        return ruPath;
      }
      i++;
    }
    wcUri = removeSlashes(removePathSegment(wcUri));
    requestUri = removeSlashes(removePathSegment(requestUri));
    if (!wcUri.length() && !requestUri.length()) {
      return "";
    }
    if (!wcUri.length() || !requestUri.length()) {
      return "";
    }
  }
  return "";
}

class WcFnRequestHandler;

typedef std::function<void(WcFnRequestHandler *handler, String requestUri, HTTPMethod method)> HandlerFunction;

class WcFnRequestHandler : public RequestHandler {
public:
    WcFnRequestHandler(HandlerFunction fn, const String &uri, HTTPMethod method, char wildcard = '*')
    : _fn(fn)
    , _uri(uri)
    , _method(method)
    , _wildcard(wildcard)
    {
      assert(_wildcard != '/');
      // verify that the URI is reasonable (only contains wildcard at the beginning/end/whole path segments
      for(int i = 0; i < _uri.length(); i++) {
        if (_uri[i] == _wildcard) {
          if (i != 0 && i != _uri.length() - 1 && (_uri[i-1] != '/' || _uri[i+1] != '/')) {
            assert(false);
          }
        }
      }
    }

    bool canHandle(HTTPMethod requestMethod, String requestUri) override  {
        if (_method != HTTP_ANY && _method != requestMethod) {
          return false;
        }

        String uri = removeSlashes(_uri);
        requestUri = removeSlashes(requestUri);
        String wildcardStr;
        wildcardStr += _wildcard;
        while (1) {
          String uPath = getPathSegment(uri);
          String ruPath = getPathSegment(requestUri);
          if (uPath != ruPath && uPath != wildcardStr) {
            return false;
          }
          uri = removeSlashes(removePathSegment(uri));
          requestUri = removeSlashes(removePathSegment(requestUri));
          if (!uri.length() && !requestUri.length()) {
            return true;
          }
          if (!uri.length() || !requestUri.length()) {
            return false;
          }
        }

