MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
        return true;
    }

    bool canUpload(String requestUri) override  {
        return false;
    }

    bool handle(ESP8266WebServer& server, HTTPMethod requestMethod, String requestUri) override {
        currentReqUri = requestUri;
        _fn(this, requestUri, requestMethod);
        currentReqUri = "";
        return true;
    }

    void upload(ESP8266WebServer& server, String requestUri, HTTPUpload& upload) override {}

    String getWildCard(int wcIndex) {
      return ::getWildCard(currentReqUri, _uri, wcIndex);
    }
protected:
    String currentReqUri;
    HandlerFunction _fn;
    String _uri;
    HTTPMethod _method;
    char _wildcard;
};

LightServiceClass::LightServiceClass() { }
LightServiceClass LightService;

QList<LightHandler*> local_lights; // interfaces exposed to the outside world
LightHandler *global_lights_get(int index) {
  if (index < local_lights.length()) {
    return local_lights[index];
  }
  index -= local_lights.length();
  if (index < foreign_lights.length()) {
    return foreign_lights[index];
  }
  return nullptr;
}

int global_lights_total() {
  return local_lights.length() + foreign_lights.length();
}

bool LightServiceClass::setLightHandler(int index, LightHandler *handler) {
  if (index < local_lights.length() - 1) setLightsAvailable(index + 1);
  local_lights[index] = handler;
  return true;
}

int LightServiceClass::addLightHandler(LightHandler *handler) {
  local_lights.push_back(handler);
  return local_lights.length() - 1;
}

bool LightServiceClass::setLightsAvailable(int lights) {
  // push out to lights-1
  if (lights <= local_lights.length()) return true;
  for (int i = lights - local_lights.length(); i > 0; i--) {
    local_lights.push_back(nullptr);
  }
  return true;
}

int LightServiceClass::getLightsAvailable() {
  return local_lights.length();
}

String StringIPaddress(IPAddress myaddr)
{
  String LocalIP = "";
  for (int i = 0; i < 4; i++)
  {
    LocalIP += String(myaddr[i]);
    if (i < 3) LocalIP += ".";
  }
  return LocalIP;
}

LightHandler *LightServiceClass::getLightHandler(int numberOfTheLight) {
  if (numberOfTheLight >= global_lights_total() || numberOfTheLight < 0) {
    return nullptr;
  }

  if (!global_lights_get(numberOfTheLight)) {
    return new LightHandler();
  }

  return global_lights_get(numberOfTheLight);
}

int LightServiceClass::getLightIndex(String lightId) {
  for (int i = 0; i < global_lights_total(); i++) {
    if (global_lights_get(i)) {
      String id = global_lights_get(i)->getId(i + 1);
      if (id == lightId) {
        return i;
      }
    }
  }

  return -1;
}

static const char* _ssdp_response_template =
  "HTTP/1.1 200 OK\r\n"
  "EXT:\r\n"
  "CACHE-CONTROL: max-age=%u\r\n" // SSDP_INTERVAL
  "LOCATION: http://%s:%u/%s\r\n" // WiFi.localIP(), _port, _schemaURL
  "SERVER: FreeRTOS/6.0.5, UPnP/1.0, %s/%s\r\n" // _modelName, _modelNumber
  "hue-bridgeid: %s\r\n"
  "ST: %s\r\n"  // _deviceType
  "USN: uuid:%s::upnp:rootdevice\r\n" // _uuid::_deviceType
  "\r\n";

static const char* _ssdp_notify_template =
  "NOTIFY * HTTP/1.1\r\n"
  "HOST: 239.255.255.250:1900\r\n"
  "NTS: ssdp:alive\r\n"
  "CACHE-CONTROL: max-age=%u\r\n" // SSDP_INTERVAL
  "LOCATION: http://%s:%u/%s\r\n" // WiFi.localIP(), _port, _schemaURL
  "SERVER: FreeRTOS/6.0.5, UPnP/1.0, %s/%s\r\n" // _modelName, _modelNumber
  "hue-bridgeid: %s\r\n"
  "NT: %s\r\n"  // _deviceType
  "USN: uuid:%s::upnp:rootdevice\r\n" // _uuid
  "\r\n";
  
static const char* _ssdp_xml_template = "<?xml version=\"1.0\" ?>"
  "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
  "<specVersion><major>1</major><minor>0</minor></specVersion>"
  "<URLBase>http://{ip}:80/</URLBase>"
  "<device>"
    "<deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType>"
    "<friendlyName>Philips hue ({ip})</friendlyName>"
    "<manufacturer>Royal Philips Electronics</manufacturer>"
    "<manufacturerURL>http://www.philips.com</manufacturerURL>"
    "<modelDescription>Philips hue Personal Wireless Lighting</modelDescription>"
    "<modelName>Philips hue bridge 2012</modelName>"
    "<modelNumber>929000226503</modelNumber>"
    "<modelURL>http://www.meethue.com</modelURL>"
    "<serialNumber>{mac}</serialNumber>"
    "<UDN>uuid:2f402f80-da50-11e1-9b23-{mac}</UDN>"
    "<presentationURL>index.html</presentationURL>"
    "<iconList>"
    "  <icon>"
    "    <mimetype>image/png</mimetype>"
    "    <height>48</height>"
    "    <width>48</width>"
    "    <depth>24</depth>"
    "    <url>hue_logo_0.png</url>"
    "  </icon>"
    "  <icon>"
    "    <mimetype>image/png</mimetype>"
    "    <height>120</height>"
    "    <width>120</width>"
    "    <depth>24</depth>"
    "    <url>hue_logo_3.png</url>"
    "  </icon>"
    "</iconList>"
  "</device>"
  "</root>";

static const char* _ssdp_search_template =
  "M-SEARCH * HTTP/1.1\r\n"
  "ST: ssdp:all\r\n"
  "MX: 3\r\n"
  "MAN: ssdp:discover\r\n"
  "HOST: 239.255.255.250:1900\r\n"
  "\r\n";

int ssdpMsgFormatCallback(SSDPClass *ssdp, char *buffer, int buff_len,
                          ssdp_method_t method, int interval, char *modelName,
                          char *modelNumber, char *uuid, char *deviceType,
                          uint32_t ip, uint16_t port, char *schemaURL) {
  switch (method) {
  case NOTIFY:
    return snprintf(buffer, buff_len,
      _ssdp_notify_template,
      interval,
      ipString.c_str(), port, schemaURL,
      modelName, modelNumber,
      bridgeIDString.c_str(),
      deviceType,
      uuid);
  case NONE:
    return snprintf(buffer, buff_len,
      _ssdp_response_template,
      interval,
      ipString.c_str(), port, schemaURL,
      modelName, modelNumber,
      bridgeIDString.c_str(),
      deviceType,
      uuid);
  case SEARCH:
    return snprintf(buffer, buff_len, _ssdp_search_template);
  }
}

QList<String> bridge_description_addresses;
void LightServiceClass::notifyCallback(SSDPClass *ssdp, IPAddress addr, uint16_t port) {
  String key, value, ext;
  bool def_hue = false;
  while (ssdp->readIncomingLine(&key, &value) > 0) {
    if (key == "LOCATION") {
      ext = value;
    }
    if (key == "hue-bridgeid") {
      def_hue = true;
    }
  }
  if (!def_hue) {
    return;
  }
  bridge_description_addresses.push_back(ext);
}

void LightServiceClass::responseCallback(SSDPClass *ssdp, IPAddress addr, uint16_t port) {
  String key, value, ext;
  bool def_hue = false;
  bool def_hue_for_reals = false;
  while (ssdp->readIncomingLine(&key, &value) > 0) {
    if (key == "EXT") {
      if (value.startsWith("LOCATION:")) {
        value = value.substring(9);
        if (value.startsWith(" ")) {
          value = value.substring(1);
        }
        ext = value;
      }
    }
    if (key == "LOCATION") {
      ext = value;
    }
    if (key == "hue-bridgeid") {
      def_hue = true;
    }
    if (key == "ST" && value == "upnp:rootdevice") {
      def_hue_for_reals = true;
    }
  }
  if (!def_hue || !def_hue_for_reals) {
    return;
  }
  bridge_description_addresses.push_back(ext);
}

class LightGroup {
  public:
    LightGroup(aJsonObject *root) {
      type = "Room";

      aJsonObject* jName = aJson.getObjectItem(root, "name");
      // jName guaranteed to exist
      name = jName->valuestring;

