MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
      aJsonObject* jLights = aJson.getObjectItem(root, "lights");
      if (jLights) {
        for (int i = 0; i < aJson.getArraySize(jLights); i++) {
          aJsonObject* jLight = aJson.getArrayItem(jLights, i);
          lights.push_back(jLight->valuestring);
        }
      }

      aJsonObject* jType = aJson.getObjectItem(root, "type");
      if (jType) {
        type = jType->valuestring;
      }
    }
    aJsonObject *getJson() {
      aJsonObject *object = aJson.createObject();
      aJson.addStringToObject(object, "name", name.c_str());
      aJsonObject *lightsState = aJson.createObject();
      aJson.addStringToObject(lightsState, "all_on", "true");
      aJson.addStringToObject(lightsState, "any_on", "true");
      aJson.addItemToObject(object, "state", lightsState);
      
      if (lights.size()) {
        aJsonObject *lightsArray = aJson.createArray();
        aJson.addItemToObject(object, "lights", lightsArray);
        for (int i = 0; i < lights.size(); i++) {
          // add light to list
          aJson.addItemToArray(lightsArray, aJson.createItem(lights[i].c_str()));
        }
      }
      aJson.addStringToObject(object, "type", "LightGroup");   
      return object;
    }


    aJsonObject *getSceneJson(bool withStates) {
      aJsonObject *object = aJson.createObject();
      if (lights.size()) {
        aJsonObject *lightsArray = aJson.createArray();
        aJson.addItemToObject(object, "lights", lightsArray);
        for (int i = 0; i < lights.size(); i++) {
          // add light to list
          aJson.addItemToArray(lightsArray, aJson.createItem(lights[i].c_str()));
        }
      }
            
      aJson.addStringToObject(object, "name", name.c_str());
      aJson.addStringToObject(object, "owner", "api");
      aJson.addBooleanToObject(object, "recycle", false);
      aJson.addBooleanToObject(object, "locked", false);
      aJsonObject *appData = aJson.createObject();
      aJson.addNumberToObject(appData, "version", 1);
      aJson.addStringToObject(appData, "data", "");
      aJson.addItemToObject(object, "appdata", appData);      
      aJson.addStringToObject(object, "picture", "");
      aJson.addStringToObject(object, "lastupdated", "2017-11-04T10:17:15");
      aJson.addNumberToObject(object, "version", 2);
      
      if(withStates==true)
      {
        Serial.println("Adding lightstates");
        aJsonObject *lightStates = aJson.createArray();  
        for (int i = 0; i < 16; i++) {
          if (!((1 << i) & lights)) {
            continue;
          }        
          // add light to list
          String lightNum = "";
          lightNum += (i + 1);
          LightHandler *handler = LightService.getLightHandler(i);
          HueLightInfo currentInfo = handler->getInfo(i);

          aJsonObject *lightState = aJson.createObject();
          aJsonObject *lightStateData = aJson.createObject();
          aJson.addBooleanToObject(lightStateData, "on", currentInfo.on);            
          aJson.addNumberToObject(lightStateData, "bri", currentInfo.brightness);
         
          aJsonObject *xy = aJson.createArray(); 
          aJson.addItemToArray(xy, aJson.createItem(0.5806));
          aJson.addItemToArray(xy, aJson.createItem(0.3903));
          aJson.addItemToObject(lightStateData,"xy",xy);
          aJson.addItemToObject(lightState, lightNum.c_str(), lightStateData);
          aJson.addItemToArray(lightStates, lightState);
          
        }        
        aJson.addItemToObject(object,"lightstates",lightStates);
      }
      
      char *json = aJson.print(object);
      //Serial.println(json);
      free(json);
      return object;
    }
    QList<String> getLightList() {
      return lights;
    }
    // only used for scenes
    String id;
    String getName()
    {
      return name;  
    }
  private:
    String name, type;
    QList<String> lights;
};

void on(HandlerFunction fn, const String &wcUri, HTTPMethod method, char wildcard = '*') {
  HTTP->addHandler(new WcFnRequestHandler(fn, wcUri, method, wildcard));
}
 
String listFiles(String _template)
{
  Serial.println(_template);
  String response = "";
    for (int i = 0; i < 16; i++) {
      String fileName = _template;
      fileName.replace("%d",String(i));
      Serial.println(fileName);
      
      //sprintf(fileName,_template,i);
      if(!SPIFFS.exists(fileName))
        continue;
        
      Serial.println("Adding file to list");
      response += "<li>" + fileName + "</li>";
    
      
    }
    return response;
}

void indexPageFn() {
	String response = "<html><body>"
	"<h2>Philips HUE ( {ip} )</h2>"
	"<p>Available lights:</p>"
	"<ul>{lights}</ul>"
  "<ul>File Cache</ul>"
  "<ul>Groups:</ul>"
  "<ul>{group-files}</ul>"
  "<ul>Scenes:</ul>"
  "<ul>{scene-files}</ul>"
  "<a href='/cache/clear'>Clear Cached Groups and Scenes</a>"
	"</body></html>";
	
	String lights = "";
	
	 for (int i = 0; i < LightService.getLightsAvailable(); i++) {
	  if (!lightHandlers[i]) {
		  continue;
	  }
	  	  
	  lights += "<li>" + lightHandlers[i]->getFriendlyName(i) + "</li>";
	}
  String sceneFiles = listFiles(SCENE_FILE_TEMPLATE);
  String groupFiles = listFiles(GROUP_FILE_TEMPLATE);
	response.replace("{ip}", ipString);
	response.replace("{lights}", lights);
	response.replace("{group-files}", groupFiles);	
  response.replace("{scene-files}", sceneFiles);  
	HTTP->send(200, "text/html", response);
}

void clearFiles(String _template)
{
    for (int i = 0; i < 16; i++) {
      String fileName = _template;
      fileName.replace("%d",String(i));
      if(SPIFFS.exists(fileName)){
        SPIFFS.remove(fileName);   
      }
    }
}

// remove the group and scene cache files
void cacheClearFn()
{
  clearFiles(GROUP_FILE_TEMPLATE);
  clearFiles(SCENE_FILE_TEMPLATE);
  indexPageFn();
}

void descriptionFn() {
  String response = _ssdp_xml_template;

  String escapedMac = macString;
  escapedMac.replace(":", "");
  escapedMac.toLowerCase();
  
  response.replace("{mac}", escapedMac);
  response.replace("{ip}", ipString);

  HTTP->send(200, "text/xml", response);
  Serial.println(response);
}

void unimpFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  String str = "{}";
  HTTP->send(200, "text/plain", str);
  Serial.println(str);
}

aJsonObject *wrapWithSuccess(aJsonObject *body) {
  aJsonObject *success = aJson.createObject();
  aJson.addItemToObject(success, "success", body);
  return success;
}

// targetBase is assumed to have a trailing slash (/)
aJsonObject *generateTargetPutResponse(aJsonObject *body, String targetBase) {
  aJsonObject *root = aJson.createArray();
  for (int i = 0; i < aJson.getArraySize(body); i++) {
    aJsonObject *success = aJson.createObject();
    aJson.addItemToArray(root, wrapWithSuccess(success));
    aJsonObject *entry = aJson.getArrayItem(body, i);
    String target = targetBase + entry->name;
    switch (entry->type) {
      case aJson_Boolean:
        aJson.addBooleanToObject(success, target.c_str(), entry->valuebool);
        break;
      case aJson_Int:
        aJson.addNumberToObject(success, target.c_str(), entry->valueint);
        break;
      case aJson_String:
        aJson.addStringToObject(success, target.c_str(), entry->valuestring);
        break;
      case aJson_Float:
        aJson.addNumberToObject(success, target.c_str(), entry->valuefloat);
        break;
      case aJson_Array: {
        aJsonObject *xy = aJson.createArray();
        aJson.addItemToObject(success, target.c_str(), xy);
        for (int j = 0; j < aJson.getArraySize(entry); j++) {
          aJson.addItemToArray(xy, aJson.createItem(aJson.getArrayItem(entry, j)->valuefloat));
        }
        break;
      }
      default:
        break;
    }
  }
  return root;
}

