MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void applyConfigToLightList();
void groupsIdActionFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  if (method != HTTP_PUT) {
    // error, only PUT allowed
    sendError(4, requestUri, "Only PUT supported for groups/*/action");
    return;
  }

  String groupNumText = handler->getWildCard(1);
  int groupNum = atoi(groupNumText.c_str()) - 1;
  if ((groupNum == -1 && groupNumText != "0") || groupNum >= 16 || (groupNum >= 0 && !lightGroups[groupNum])) {
    // error, invalid group number
    sendError(3, requestUri, "Invalid group number");
    return;
  }
  // apply to group
  applyConfigToLightList();
}

void lightsFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  switch (method) {
    case HTTP_GET: {
      // dump existing lights
      aJsonObject *lights = aJson.createObject();
      addLightsJson(lights);
      sendJson(lights);
      break;
    }
    case HTTP_POST:
      // "start" a "search" for "new" lights
      sendSuccess("/lights", "Searching for new devices");
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void addSingleLightJson(aJsonObject* , int , LightHandler *);
void lightsIdFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = LightService.getLightIndex(whandler->getWildCard(1).c_str());
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  switch (method) {
    case HTTP_GET: {
      aJsonObject *root;
      root = aJson.createObject();
      addSingleLightJson(root, numberOfTheLight, handler);
      sendJson(root);
      break;
    }
    case HTTP_PUT:
      // XXX do something here
      sendUpdated();
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsIdStateFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = LightService.getLightIndex(whandler->getWildCard(1).c_str());
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  if (!handler) {
    char buff[100] = {};
    sprintf(buff, "Requested light not available for number %d", numberOfTheLight);
    sendError(3, requestUri, buff);
    return;
  }

  switch (method) {
    case HTTP_POST:
    case HTTP_PUT: { 
      aJsonObject* parsedRoot = aJson.parse( (char*) HTTP->arg("plain").c_str());   
      if (!parsedRoot) {
        // unparseable json
          sendError(2, requestUri, "Bad JSON body in request");
          return;       
      }
      HueLightInfo currentInfo = handler->getInfo(numberOfTheLight);
      HueLightInfo newInfo;
      if (!parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        aJson.deleteItem(parsedRoot);
        return;
      }
      
      handler->handleQuery(numberOfTheLight, newInfo, parsedRoot);
      sendJson(generateTargetPutResponse(parsedRoot, "/lights/" + whandler->getWildCard(1) + "/state/"));
      aJson.deleteItem(parsedRoot);
      break;
    }
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsNewFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // dump empty object
  aJsonObject *lights = aJson.createObject();
  sendJson(lights);
}

void LightServiceClass::begin() {
  begin(new ESP8266WebServer(80));
}

void initializeGroupSlots();
void initializeSceneSlots();
void LightServiceClass::begin(ESP8266WebServer *svr) {
  HTTP = svr;
  macString = WiFi.macAddress();
  bridgeIDString = macString;
  bridgeIDString.replace(":", "");
  bridgeIDString = bridgeIDString.substring(0, 6) + "FFFE" + bridgeIDString.substring(6);
  ipString = StringIPaddress(WiFi.localIP());
  netmaskString = StringIPaddress(WiFi.subnetMask());
  gatewayString = StringIPaddress(WiFi.gatewayIP());

  Serial.print("Starting HTTP at ");
  Serial.print(WiFi.localIP());
  Serial.print(":");
  Serial.println(80);

  HTTP->on("/index.html", HTTP_GET, indexPageFn);
  HTTP->on("/cache/clear", HTTP_GET, cacheClearFn);
  HTTP->on("/description.xml", HTTP_GET, descriptionFn);
  on(configFn, "/api/*/config", HTTP_ANY);
  on(configFn, "/api/config", HTTP_GET);
  on(wholeConfigFn, "/api/*", HTTP_GET);
  on(wholeConfigFn, "/api/", HTTP_GET);
  on(authFn, "/api", HTTP_POST);
  on(unimpFn, "/api/*/schedules", HTTP_GET);
  on(unimpFn, "/api/*/rules", HTTP_GET);
  on(unimpFn, "/api/*/sensors", HTTP_GET);
  on(scenesFn, "/api/*/scenes", HTTP_ANY);
  on(scenesIdFn, "/api/*/scenes/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lightstates/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lights/*/state", HTTP_ANY);
  on(groupsFn, "/api/*/groups", HTTP_ANY);
  on(groupsIdFn, "/api/*/groups/*", HTTP_ANY);
  on(groupsIdActionFn, "/api/*/groups/*/action", HTTP_ANY);
  on(lightsFn, "/api/*/lights", HTTP_ANY);
  on(lightsNewFn, "/api/*/lights/new", HTTP_ANY);
  on(lightsIdFn, "/api/*/lights/*", HTTP_ANY);
  on(lightsIdStateFn, "/api/*/lights/*/state", HTTP_ANY);

  HTTP->begin();

  String serial = macString;
  serial.toLowerCase();
  
  Serial.println("Starting SSDP...");
  SSDP.setSchemaURL("description.xml");
  SSDP.setHTTPPort(80);
  SSDP.setName("Philips hue clone");
  SSDP.setSerialNumber(serial.c_str());
  SSDP.setURL("index.html");
  SSDP.setModelName("IpBridge");
  SSDP.setModelNumber("0.1");
  SSDP.setModelURL("http://www.meethue.com");
  SSDP.setManufacturer("Royal Philips Electronics");
  SSDP.setManufacturerURL("http://www.philips.com");

  //SSDP.setDeviceType((char*)"upnp:rootdevice");
  SSDP.setDeviceType("urn:schemas-upnp-org:device:basic:1");
  //SSDP.setMessageFormatCallback(ssdpMsgFormatCallback);
  SSDP.begin();
  Serial.println("SSDP Started");
  Serial.println("FS Starting");
  SPIFFS.begin();
  initializeGroupSlots();
  initializeSceneSlots();

}

QList<String> known_bridges;
void handleBridgeFound() {
  if (!bridge_description_addresses.length()) {
    return;
  }

  String location = bridge_description_addresses.front();
  bridge_description_addresses.pop_front();
  if (known_bridges.indexOf(location) != -1) {
    return;
  }
  known_bridges.push_back(location);
  HTTPClient http;
  bool begin_ret = http.begin(location);
  int responseCode = http.GET();
  if (responseCode != 200) {
    http.end();
    return;
  }
  String payload = http.getString();
  http.end();
  int startloc = payload.indexOf("<modelName>");
  int endloc = payload.indexOf("</modelName>");
  startloc += strlen("<modelName>");
  String modelName = payload.substring(startloc, endloc);
  startloc = payload.indexOf("<URLBase>");
  endloc = payload.indexOf("</URLBase>");
  startloc += strlen("<URLBase>");
  String urlbase = payload.substring(startloc, endloc);
  startloc = payload.indexOf("<serialNumber>");
  endloc = payload.indexOf("</serialNumber>");
  startloc += strlen("<serialNumber>");
  String remoteMac = payload.substring(startloc, endloc);
  // allowable characters in fake id are alphanumerics, "-", ".", "_", "~"
  String targetApi = urlbase + "api/api/lights";
  begin_ret = http.begin(targetApi);
  responseCode = http.GET();
  if (responseCode != 200) {
    Serial.print("Got bad response from lights api: ");
    Serial.println(targetApi);
    http.end();
    return;
  }
  payload = http.getString();
  aJsonObject* body = aJson.parse(( char*) payload.c_str());
  http.end();
  for (int i = 0; i < aJson.getArraySize(body); i++) {
    aJsonObject *entry = aJson.getArrayItem(body, i);
    entry->name;
    switch (entry->type) {
      case aJson_Object: {
          foreign_lights.push_back(new ProxyHandler(urlbase, remoteMac, entry));
          break;
        }
      default:
        // wut?
        break;
    }
  }
}

void LightServiceClass::enableBridgeMeshing() {
  // enable bridge meshing
  SSDP.setNotifyCallback(std::bind(&LightServiceClass::notifyCallback, this, _1, _2, _3));
  SSDP.setResponseCallback(std::bind(&LightServiceClass::responseCallback, this, _1, _2, _3));
  SSDP.beginSearch();
}

void LightServiceClass::disableBridgeMeshing() {
  // disable bridge meshing
  SSDP.setNotifyCallback(nullptr);
  SSDP.setResponseCallback(nullptr);
  // clear list
  while (foreign_lights.length()) {
    delete foreign_lights.front();
    foreign_lights.pop_front();
  }
}

void LightServiceClass::update() {
  HTTP->handleClient();
  handleBridgeFound();
}

