MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
bool bufferlessResponses = false;
void LightServiceClass::setBufferlessResponses(bool enabled) {
  bufferlessResponses = enabled;
}

#include "Stream.h"
class WebServerStream : public Stream {
  public:
    WebServerStream() {}
    ~WebServerStream() {}
    size_t write(uint8_t ch) override {
      HTTP->client().write(&ch, 1);
      return 1;
    }
    size_t write(const uint8_t *str, size_t size) override {
      HTTP->client().write(str, size);
      return 1;
    }
    int available(void) override { return 1; }
    int peek(void) override { return 1; }
    int read(void) override { return 1; }
    int availableForWrite(void) { return 1; }
    void flush(void) override {}
};

class StringStream : public Stream {
  public:
    StringStream(String& buf): buf(buf) {}
    ~StringStream() {}
    size_t write(uint8_t ch) override {
      buf += (char)ch;
      return 1;
    }
    int available(void) override { return 1; }
    int peek(void) override { return 1; }
    int read(void) override { return 1; }
    int availableForWrite(void) { return 1; }
    void flush(void) override {}
  private:
    String &buf;
};

class CountStream : public Stream {
  public:
    CountStream() {}
    ~CountStream() {}
    size_t write(uint8_t ch) override {
      count++;
      return 1;
    }
    int available(void) override { return 1; }
    int peek(void) override { return 1; }
    int read(void) override { return 1; }
    int availableForWrite(void) { return 1; }
    void flush(void) override {}
    long count = 0;
};

WebServerStream *WebStream = new WebServerStream();
CountStream *CStream = new CountStream();
aJsonStream serial_stream(&Serial);
aJsonStream web_stream(WebStream);
aJsonStream count_stream(CStream);
void sendJson(aJsonObject *root)
{
  Serial.println(millis());

  if (bufferlessResponses) {
    CStream->count = 0;
    aJson.print(root, &count_stream);
    HTTP->setContentLength(CStream->count+1);
    HTTP->send(200, "application/json", "");
    aJson.print(root, &web_stream);
    HTTP->sendContent("\n");
  } else {
    CStream->count = 0;
    aJson.print(root, &count_stream);
    String outstr;
    outstr.reserve(CStream->count+1);
    StringStream *SStream = new StringStream(outstr);
    aJsonStream string_stream(SStream);
    aJson.print(root, &string_stream);
    outstr += '\n';
    HTTP->send(200, "application/json", outstr);
  }

  Serial.println(millis());
  aJson.print(root, &serial_stream);
  Serial.println();
  aJson.deleteItem(root);
}

// ==============================================================================================================
// Color Conversion
// ==============================================================================================================
// TODO: Consider switching to something along the lines of
// https://github.com/patdie421/mea-edomus/blob/master/src/philipshue_color.c
// and/ or https://github.com/kayno/arduinolifx/blob/master/color.h
// for color coversions instead
// ==============================================================================================================

// Based on http://stackoverflow.com/questions/22564187/rgb-to-philips-hue-hsb
// The code is based on this brilliant note: https://github.com/PhilipsHue/PhilipsHueSDK-iOS-OSX/commit/f41091cf671e13fe8c32fcced12604cd31cceaf3

rgbcolor getXYtoRGB(float x, float y, int brightness_raw) {
  float Y = brightness_raw / 250.0f;

  float z = 1.0f - x - y;
  float X = (Y / y) * x;
  float Z = (Y / y) * z;

  // sRGB D65 conversion
  // See https://en.wikipedia.org/wiki/SRGB
  float r =  X * 3.2406f - Y * 1.5372f - Z * 0.4986f;
  float g = -X * 0.9689f + Y * 1.8758f + Z * 0.0415f;
  float b =  X * 0.0557f - Y * 0.2040f + Z * 1.0570f;

  if (r > b && r > g && r > 1.0f) {
    // red is too big
    g = g / r;
    b = b / r;
    r = 1.0f;
  }
  else if (g > b && g > r && g > 1.0f) {
    // green is too big
    r = r / g;
    b = b / g;
    g = 1.0f;
  }
  else if (b > r && b > g && b > 1.0f) {
    // blue is too big
    r = r / b;
    g = g / b;
    b = 1.0f;
  }

  // Apply gamma correction
  r = r <= 0.0031308f ? 12.92f * r : (1.0f + 0.055f) * pow(r, (1.0f / 2.4f)) - 0.055f;
  g = g <= 0.0031308f ? 12.92f * g : (1.0f + 0.055f) * pow(g, (1.0f / 2.4f)) - 0.055f;
  b = b <= 0.0031308f ? 12.92f * b : (1.0f + 0.055f) * pow(b, (1.0f / 2.4f)) - 0.055f;

  if (r > b && r > g) {
    // red is biggest
    if (r > 1.0f) {
      g = g / r;
      b = b / r;
      r = 1.0f;
    }
  }
  else if (g > b && g > r) {
    // green is biggest
    if (g > 1.0f) {
      r = r / g;
      b = b / g;
      g = 1.0f;
    }
  }
  else if (b > r && b > g) {
    // blue is biggest
    if (b > 1.0f) {
      r = r / b;
      g = g / b;
      b = 1.0f;
    }
  }

  r = r < 0 ? 0 : r;
  g = g < 0 ? 0 : g;
  b = b < 0 ? 0 : b;

  return rgbcolor(r * COLOR_SATURATION,
                  g * COLOR_SATURATION,
                  b * COLOR_SATURATION);
}

int getHue(hsvcolor hsb) {
  return hsb.h * 360 * 182.04;
}

int getSaturation(hsvcolor hsb) {
  return hsb.s * COLOR_SATURATION;
}

rgbcolor getMirektoRGB(int mirek) {
  int hectemp = 10000 / mirek;
  int r, g, b;
  if (hectemp <= 66) {
    r = COLOR_SATURATION;
    g = 99.4708025861 * log(hectemp) - 161.1195681661;
    b = hectemp <= 19 ? 0 : (138.5177312231 * log(hectemp - 10) - 305.0447927307);
  } else {
    r = 329.698727446 * pow(hectemp - 60, -0.1332047592);
    g = 288.1221695283 * pow(hectemp - 60, -0.0755148492);
    b = COLOR_SATURATION;
  }
  r = r > COLOR_SATURATION ? COLOR_SATURATION : r;
  g = g > COLOR_SATURATION ? COLOR_SATURATION : g;
  b = b > COLOR_SATURATION ? COLOR_SATURATION : b;
  return rgbcolor(r, g, b);
}

void sendError(int type, String path, String description) {
  aJsonObject *root = aJson.createArray();
  aJsonObject *errorContainer = aJson.createObject();
  aJsonObject *errorObject = aJson.createObject();
  aJson.addItemToObject(errorObject, "type", aJson.createItem(type));
  aJson.addStringToObject(errorObject, "address", path.c_str());
  aJson.addStringToObject(errorObject, "description", description.c_str());
  aJson.addItemToObject(errorContainer, "error", errorObject);
  aJson.addItemToArray(root, errorContainer);
  sendJson(root);
}

void sendSuccess(String id, String value) {
  aJsonObject *search = aJson.createArray();
  aJsonObject *container = aJson.createObject();
  aJson.addItemToArray(search, container);
  aJsonObject *succeed = aJson.createObject();
  aJson.addItemToObject(container, "success", succeed);
  aJson.addStringToObject(succeed, id.c_str(), value.c_str());
  sendJson(search);
}

void sendSuccess(String value) {
  aJsonObject *search = aJson.createArray();
  aJsonObject *container = aJson.createObject();
  aJson.addItemToArray(search, container);
  aJsonObject *succeed = aJson.createObject();
  aJson.addStringToObject(container, "success", value.c_str());
  sendJson(search);
}

