MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void sendUpdated() {
  Serial.println("Updated.");
  HTTP->send(200, "text/plain", "Updated.");
}

bool parseHueLightInfo(HueLightInfo currentInfo, aJsonObject *parsedRoot, HueLightInfo *newInfo) {
  *newInfo = currentInfo;
  aJsonObject* onState = aJson.getObjectItem(parsedRoot, "on");
  if (onState) {
    newInfo->on = onState->valuebool;
  }

  // pull brightness
  aJsonObject* briState = aJson.getObjectItem(parsedRoot, "bri");
  if (briState) {
    newInfo->brightness = briState->valueint;
  }

  // pull effect
  aJsonObject* effectState = aJson.getObjectItem(parsedRoot, "effect");
  if (effectState) {
    newInfo->effect = effectState->valuestring;
  }

  // pull alert
  aJsonObject* alertState = aJson.getObjectItem(parsedRoot, "alert");
  if (alertState) {
    newInfo->alert = alertState->valuestring;
  }

  // pull transitiontime
  aJsonObject* transitiontimeState = aJson.getObjectItem(parsedRoot, "transitiontime");
  if (transitiontimeState) {
    newInfo->transitionTime = transitiontimeState->valueint;
  }

  aJsonObject* hueState = aJson.getObjectItem(parsedRoot, "hue");
  aJsonObject* satState = aJson.getObjectItem(parsedRoot, "sat");
  aJsonObject* ctState = aJson.getObjectItem(parsedRoot, "ct");
  aJsonObject* xyState = aJson.getObjectItem(parsedRoot, "xy");
  if (xyState) {
    aJsonObject* elem0 = aJson.getArrayItem(xyState, 0);
    aJsonObject* elem1 = aJson.getArrayItem(xyState, 1);
    if (!elem0 || !elem1) {
      sendError(5, "/api/api/lights/?/state", "xy color coordinates incomplete");
      return false;
    }
    hsvcolor hsb = getXYtoRGB(elem0->valuefloat, elem1->valuefloat, newInfo->brightness);
    newInfo->hue = getHue(hsb);
    newInfo->saturation = getSaturation(hsb);
  } else if (ctState) {
    int mirek = ctState->valueint;
    if (mirek > 500 || mirek < 153) {
      sendError(7, "/api/api/lights/?/state", "Invalid value for color temperature");
      return false;
    }

    hsvcolor hsb = getMirektoRGB(mirek);
    newInfo->hue = getHue(hsb);
    newInfo->saturation = getSaturation(hsb);
  } else if (hueState || satState) {
    if (hueState) newInfo->hue = hueState->valueint;
    if (satState) newInfo->saturation = satState->valueint;
  }
  return true;
}



void addSingleLightJson(aJsonObject* root, int numberOfTheLight, LightHandler *lightHandler) {
  if (!lightHandler) return;
  String lightNumber = lightHandler->getId(numberOfTheLight + 1);
  String lightName = lightHandler->getFriendlyName(numberOfTheLight);
  
  aJson.addStringToObject(root, "manufacturername", "OpenSource"); // type of lamp (all "Extended colour light" for now)
  aJson.addStringToObject(root, "modelid", "LST001"); // the model number
  aJson.addStringToObject(root, "name",  lightName.c_str()); // // the name as set through the web UI or app
  aJsonObject *light;
  aJson.addItemToObject(root, lightName.c_str(), light = aJson.createObject());
  aJsonObject *state;
  aJson.addItemToObject(root, "state", state = aJson.createObject());
  HueLightInfo info = lightHandler->getInfo(numberOfTheLight + 1);
  aJson.addBooleanToObject(state, "on", info.on);
  aJson.addBooleanToObject(state, "local", info.local);
  aJson.addNumberToObject(state, "hue", info.hue); // hs mode: the hue (expressed in ~deg*182.04)
  aJson.addNumberToObject(state, "bri", info.brightness); // brightness between 0-254 (NB 0 is not off!)
  aJson.addNumberToObject(state, "sat", info.saturation); // hs mode: saturation between 0-254
  double numbers[2] = {0.0, 0.0};
  aJson.addItemToObject(state, "xy", aJson.createFloatArray(numbers, 2)); // xy mode: CIE 1931 color co-ordinates
  aJson.addNumberToObject(state, "ct", 500); // ct mode: color temp (expressed in mireds range 154-500)
  aJson.addStringToObject(state, "alert", info.alert.c_str()); // 'select' flash the lamp once, 'lselect' repeat flash for 30s
  aJson.addStringToObject(state, "effect", info.effect.c_str());
  aJson.addStringToObject(state, "colormode", "hs"); // the current color mode
  aJson.addBooleanToObject(state, "reachable", true); // lamp can be seen by the hub  aJson.addStringToObject(root, "type", "Extended color light"); // type of lamp (all "Extended colour light" for now)
  
  aJson.addStringToObject(root, "swversion", "0.1"); // type of lamp (all "Extended colour light" for now)
  if (info.bulbType == HueBulbType::DIMMABLE_LIGHT) {
    aJson.addStringToObject(root, "type", "Dimmable light");
  } else {
    aJson.addStringToObject(root, "type", "Extended color light");
  }
  aJson.addStringToObject(root, "uniqueid",  lightNumber.c_str());

}


void addLightJson(aJsonObject* root, int numberOfTheLight, LightHandler *lightHandler) {
  if (!lightHandler) 
    return;

  
  String lightNumber = (String) (numberOfTheLight + 1);
  String lightName = lightHandler->getFriendlyName(numberOfTheLight);
  aJsonObject *light;
  aJson.addItemToObject(root, lightNumber.c_str(), light = aJson.createObject());

  HueLightInfo info = lightHandler->getInfo(numberOfTheLight);
  if (info.bulbType == HueBulbType::DIMMABLE_LIGHT) {
    aJson.addStringToObject(light, "type", "Dimmable light");
  } else {
    aJson.addStringToObject(light, "type", "Extended color light");
  }
  
  aJson.addStringToObject(light, "manufacturername", "OpenSource"); // type of lamp (all "Extended colour light" for now)
  aJson.addStringToObject(light, "swversion", "0.1");
  aJson.addStringToObject(light, "name",  lightName.c_str()); // // the name as set through the web UI or app
  aJson.addStringToObject(light, "uniqueid",  (macString + "-" + (String) (numberOfTheLight + 1)).c_str());
  aJson.addStringToObject(light, "modelid", "LST001"); // the model number
  
  aJsonObject *state;
  aJson.addItemToObject(light, "state", state = aJson.createObject());
  aJson.addBooleanToObject(state, "on", info.on);

  aJson.addNumberToObject(state, "bri", info.brightness); // brightness between 0-254 (NB 0 is not off!)

  if (info.bulbType == HueBulbType::EXTENDED_COLOR_LIGHT) {
    double numbers[2] = {0.0, 0.0};
    aJson.addItemToObject(state, "xy", aJson.createFloatArray(numbers, 2)); // xy mode: CIE 1931 color co-ordinates
    aJson.addStringToObject(state, "colormode", "hs"); // the current color mode
    aJson.addStringToObject(state, "effect", info.effect == EFFECT_COLORLOOP ? "colorloop" : "none");
    aJson.addNumberToObject(state, "ct", 500); // ct mode: color temp (expressed in mireds range 154-500)

    aJson.addNumberToObject(state, "hue", info.hue); // hs mode: the hue (expressed in ~deg*182.04)
    aJson.addNumberToObject(state, "sat", info.saturation); // hs mode: saturation between 0-254
  }
  
