MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  aJson.addStringToObject(state, "alert", "none"); // 'select' flash the lamp once, 'lselect' repeat flash for 30s
  aJson.addBooleanToObject(state, "reachable", true); // lamp can be seen by the hub
}

void addLightsJson(aJsonObject *lights) {
  for (int i = 0; i < LightService.getLightsAvailable(); i++) {
    addLightJson(lights, i, LightService.getLightHandler(i));
  }
}

static String format2Digits(int num) {
  String s = "";

  if (num < 10) {
    s += "0";
  }
  s += String(num);
  return s;
}

void addConfigJson(aJsonObject *root)
{
  aJson.addStringToObject(root, "name", "hue emulator");
  aJson.addStringToObject(root, "swversion", "81012917");
  aJson.addStringToObject(root, "bridgeid", bridgeIDString.c_str());
  aJson.addBooleanToObject(root, "portalservices", false);
  aJson.addBooleanToObject(root, "linkbutton", true);
  aJson.addStringToObject(root, "mac", macString.c_str());
  aJson.addBooleanToObject(root, "dhcp", true);
  aJson.addStringToObject(root, "ipaddress", ipString.c_str());
  aJson.addStringToObject(root, "netmask", netmaskString.c_str());
  aJson.addStringToObject(root, "gateway", gatewayString.c_str());
  aJson.addStringToObject(root, "apiversion", "1.3.0");
  if (timeStatus() == timeSet) {
    time_t moment = now();
    String dts = String(year(moment));
    dts += "-";
    dts += format2Digits(month(moment));
    dts += "-";
    dts += format2Digits(day(moment));
    dts += "T";
    dts += NTP.getTimeStr(moment);

    // TODO: send this as "utc" and "localtime" as timezone corrected utc
    aJson.addStringToObject(root, "localtime", dts.c_str());
  }
  // TODO: take this from the settings, once we have spiffs support
  aJson.addStringToObject(root, "timezone", "Europe/London");
  aJsonObject *whitelist;
  aJson.addItemToObject(root, "whitelist", whitelist = aJson.createObject());
  aJsonObject *whitelistFirstEntry;
  aJson.addItemToObject(whitelist, "api", whitelistFirstEntry = aJson.createObject());
  aJson.addStringToObject(whitelistFirstEntry, "name", "clientname#devicename");
  aJsonObject *swupdate;
  aJson.addItemToObject(root, "swupdate", swupdate = aJson.createObject());
  aJson.addStringToObject(swupdate, "text", "");
  aJson.addBooleanToObject(swupdate, "notify", false); // Otherwise client app shows update notice
  aJson.addNumberToObject(swupdate, "updatestate", 0);
  aJson.addStringToObject(swupdate, "url", "");
}

String trimSlash(String uri) {
  if (uri.startsWith("/")) {
    uri.remove(0, 1);
  }
  return uri;
}

aJsonObject *validateGroupCreateBody(String body) {
  aJsonObject *root = aJson.parse(( char*) body.c_str());
  aJsonObject* jName = aJson.getObjectItem(root, "name");
  if (!jName) {
    return nullptr;
  }
  return root;
}

void applyConfigToLightList() {
  Serial.print("applyConfigToLightList:");
  Serial.println(HTTP->arg("plain"));
  aJsonObject* parsedRoot = aJson.parse(( char*) HTTP->arg("plain").c_str());
  if (parsedRoot) {
    for (int i = 0; i < LightService.getLightsAvailable(); i++) {
      LightHandler *handler = LightService.getLightHandler(i);
      HueLightInfo currentInfo = handler->getInfo(i);
      HueLightInfo newInfo;
      if (parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        handler->handleQuery(i, newInfo, parsedRoot);
      }
    }
    aJson.deleteItem(parsedRoot);

    // As per the spec, the response can be "Updated." for memory-constrained devices
    sendUpdated();
  } else if (HTTP->arg("plain") != "") {
    // unparseable json
    sendError(2, "groups/0/action", "Bad JSON body in request");
  }
}
// check the file system and restore group slots from them
void  initializeGroupSlots()
{
  Serial.println("initializeGroupSlots()");
  for (int i = 0; i < 16; i++) {
    String fileName = GROUP_FILE_TEMPLATE;
    fileName.replace("%d",String(i));
    //Serial.print("Testing for ");Serial.println(fileName);
    if (SPIFFS.exists(fileName)) {   
      // read the file into the groupslot position
      File f  = SPIFFS.open(fileName,"r");
      if(f)
      {
        size_t fsize = f.size();
        std::unique_ptr<char[]> buf (new char[fsize]);
        Serial.println("Reading in to buffer");
        f.readBytes(buf.get(), fsize);    
        lightGroups[i] = new LightGroup(aJson.parse(buf.get()));
        f.close();
        Serial.print("Loading "); Serial.println(fileName);
      }
      else
      {
        Serial.println("Can't open");
      }

    }
    else
    {
      //Serial.println("Not found");
    }  
  }
}


LightGroup *lightScenes[16] = {nullptr, };

// check the file system and restore group slots from them
void  initializeSceneSlots()
{
  Serial.println("initializeSceneSlots()");
  for (int i = 0; i < 16; i++) {
    String fileName = SCENE_FILE_TEMPLATE;
    fileName.replace("%d",String(i));
    //Serial.print("Testing for ");Serial.println(fileName);
    if (SPIFFS.exists(fileName)) {   
      // read the file into the groupslot position
      File f  = SPIFFS.open(fileName,"r");
      if(f)
      {
        size_t fsize = f.size();
        std::unique_ptr<char[]> buf (new char[fsize]);
        Serial.println("Reading in to buffer");
        f.readBytes(buf.get(), fsize);            
        lightScenes[i] = new LightGroup(aJson.parse(buf.get()));
        lightScenes[i]->id = String(i,DEC);
        f.close();
        Serial.print("Loading "); Serial.println(fileName);
        
      }
      else
      {
        Serial.println("Can't open");
      }

    }
    else
    {
      //Serial.println("Not found");
    }  
  }
}

// returns true on failure
bool updateGroupSlot(int slot, String body) {
  String fileName = GROUP_FILE_TEMPLATE;
  fileName.replace("%d",String(slot));
  
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateGroupSlot:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "groups/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightGroups[slot]) {
    delete lightGroups[slot];
    lightGroups[slot] = nullptr;
    if (SPIFFS.exists(fileName))
      SPIFFS.remove(fileName);
  }
  if (body != "") {
    Serial.print("Updating ");Serial.println(fileName);
    lightGroups[slot] = new LightGroup(root);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightGroups[slot]->getJson());
    f.print(json);
    free(json);
    f.close();
    aJson.deleteItem(root);
  }
  return false;
}

void groupCreationHandler() {
  // handle group creation
  // find first available group slot
  int availableSlot = -1;
  for (int i = 0; i < 16; i++) {  // TEST start at 1 instead of 0
    if (!lightGroups[i]) {   
      availableSlot = i;
      break;
    }
  }
  if (availableSlot == -1) {
    // throw error no new groups allowed
    sendError(301, "groups", "Groups table full");
    return;
  }
  if (!updateGroupSlot(availableSlot, HTTP->arg("plain"))) {
    String slot = "";
    slot += (availableSlot + 1);
    sendSuccess("id", slot);
  }
}

aJsonObject *getGroupJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightGroups[i]) {
      String sIndex = "";
      sIndex += (i + 1);
      aJson.addItemToObject(root, sIndex.c_str(), lightGroups[i]->getJson());
    }
  }
  return root;
}

void groupListingHandler() {
  sendJson(getGroupJson());
}


int findSceneIndex(String id) {
  int index = -1;
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return i;
      }
    } else if (index == -1) {
      index = i;
    }
  }
  return index;
}

bool updateSceneSlot(int slot, String id, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateSceneSlot:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "scenes/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightScenes[slot]) {
    String fileName = SCENE_FILE_TEMPLATE;
    fileName.replace("%d",String(slot));
    delete lightScenes[slot];
    lightScenes[slot] = nullptr;
    if(SPIFFS.exists(fileName)){
      SPIFFS.remove(fileName);   
    }
  }
  if (body != "") {
    lightScenes[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

