MrTheBarbarian/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
String scenePutHandler(String id) {
  Serial.print("sceneCreationHandler()");Serial.println(id);
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return "";
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP->arg("plain"))) {
      id = String(sceneIndex,DEC);
    // TODO - add file saves here
    Serial.print("updating lightScene->id to ");Serial.println(id);
    lightScenes[sceneIndex]->id = id;

    aJsonObject *root= aJson.createArray();
    aJsonObject *response1 = aJson.createArray();
    aJsonObject *response2 = aJson.createArray();
    aJsonObject *lights = aJson.createArray();
          for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lightScenes[sceneIndex]->getLightMask())) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lights, aJson.createItem(lightNum.c_str()));
      }
    aJsonObject *addr1 = aJson.createObject();
    aJsonObject *addr2 = aJson.createObject();
    aJsonObject *success1 = aJson.createObject();
    aJsonObject *success2 = aJson.createObject();
    char addressBuffer[30];
    sprintf(addressBuffer,"/scenes/%d/name",sceneIndex);
    aJson.addStringToObject(addr1, "address", addressBuffer);
    aJson.addStringToObject(addr1, "value", lightScenes[sceneIndex]->getName().c_str());
    sprintf(addressBuffer,"/scenes/%d/lights",sceneIndex);
    aJson.addStringToObject(addr2, "address", addressBuffer);
    aJson.addItemToObject(addr2, "value", lights);   
     
    aJson.addItemToObject(success1, "success", addr1);
    aJson.addItemToObject(success2, "success", addr2);

    aJson.addItemToArray(root, success1);
    aJson.addItemToArray(root, success2);
    sendJson(root);
    
    // now save to file
    String fileName = SCENE_FILE_TEMPLATE;
    fileName.replace("%d",String(sceneIndex));
    Serial.print("Updating Scene ");Serial.print(id);Serial.println(fileName);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightScenes[sceneIndex]->getSceneJson(true));
    f.print(json);
    return id;
  }
}

void sceneCreationHandler(String id) {
  Serial.print("sceneCreationHandler()");Serial.println(id);
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return;
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP->arg("plain"))) {
    //if (id == "") {
      id = String(sceneIndex,DEC);
    //}
    // TODO - add file saves here
    Serial.print("updating lightScene->id to ");Serial.println(id);
    lightScenes[sceneIndex]->id = id;
    sendSuccess("id", id);
    // now save to file
    String fileName = SCENE_FILE_TEMPLATE;
    fileName.replace("%d",String(sceneIndex));
    Serial.print("Updating Scene ");Serial.print(id);Serial.println(fileName);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightScenes[sceneIndex]->getSceneJson(true));
    f.print(json);
    
    return;
  }
}

aJsonObject *getSceneJson() {
  // iterate over scenes and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightScenes[i]) {
      Serial.print("Returning Scene :");Serial.println(lightScenes[i]->id.c_str());
      aJson.addItemToObject(root, lightScenes[i]->id.c_str(), lightScenes[i]->getSceneJson(true));
    }
  }
  return root;
}

void sceneListingHandler() {
  sendJson(getSceneJson());
}

LightGroup *findScene(String id) {
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return scene;
      }
    }
  }
  return nullptr;
}

String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

